In [9]:
data1 = data.frame(sid=c(1,2,3,4,5,7),
                  name=c("Sam","Vijay","Tanvi","Rashmi","Parag","Niraj"),
                  address=c("GangaNagar","Jaipur","Mathura","UP","Jaipur","Jaipur"))

In [10]:
data2 = data.frame(id=c(1,2,3,4,5,6),
                   fees=c(15000,25000,12000,10000,12000,20000),
                   course=c('linux','data science','python','linux','linux','python')
                   )

In [11]:
data1

  sid name   address
1 1   Sam    GangaNagar
2 2   Vijay  Jaipur
3 3   Tanvi  Mathura
4 4   Rashmi UP
5 5   Parag  Jaipur
6 7   Niraj  Jaipur

In [12]:
data2

  id fees  course
1 1  15000 linux
2 2  25000 data science
3 3  12000 python
4 4  10000 linux
5 5  12000 linux
6 6  20000 python

In [15]:
data = merge(x=data1,y=data2,by.x='sid',by.y='id')

In [16]:
data

  sid name   address    fees  course
1 1   Sam    GangaNagar 15000 linux
2 2   Vijay  Jaipur     25000 data science
3 3   Tanvi  Mathura    12000 python
4 4   Rashmi UP         10000 linux
5 5   Parag  Jaipur     12000 linux

In [18]:
#based on two columns 
football = data.frame(name=c("Rahul","Punit","Jhon","Natsha","Harry"),
                     position=c("Center","Forward","Goal Keeper","Forward","Defence")
                     )
cricket = data.frame(player_name=c("Sachin","Rahul","Rajat","Ravi","John","Harry"),
                    type=c("BatsMan","Fast Bowler","Spin Bowler","Wicket Keeper","All rounder","Batsman")
                    )

In [19]:
football

  name   position
1 Rahul  Center
2 Punit  Forward
3 Jhon   Goal Keeper
4 Natsha Forward
5 Harry  Defence

In [20]:
cricket

  player_name type
1 Sachin      BatsMan
2 Rahul       Fast Bowler
3 Rajat       Spin Bowler
4 Ravi        Wicket Keeper
5 John        All rounder
6 Harry       Batsman

In [21]:
common = merge(x=football,y=cricket,by.x='name',by.y='player_name')

In [22]:
common

  name  position type
1 Harry Defence  Batsman
2 Rahul Center   Fast Bowler

In [23]:
data1

  sid name   address
1 1   Sam    GangaNagar
2 2   Vijay  Jaipur
3 3   Tanvi  Mathura
4 4   Rashmi UP
5 5   Parag  Jaipur
6 7   Niraj  Jaipur

In [24]:
data2

  id fees  course
1 1  15000 linux
2 2  25000 data science
3 3  12000 python
4 4  10000 linux
5 5  12000 linux
6 6  20000 python

In [26]:
#cbind 
new_data = cbind(data1[,c("sid","name")],data2[,c("fees","course")])

In [27]:
new_data

  sid name   fees  course
1 1   Sam    15000 linux
2 2   Vijay  25000 data science
3 3   Tanvi  12000 python
4 4   Rashmi 10000 linux
5 5   Parag  12000 linux
6 7   Niraj  20000 python

In [28]:
football

  name   position
1 Rahul  Center
2 Punit  Forward
3 Jhon   Goal Keeper
4 Natsha Forward
5 Harry  Defence

In [29]:
cricket

  player_name type
1 Sachin      BatsMan
2 Rahul       Fast Bowler
3 Rajat       Spin Bowler
4 Ravi        Wicket Keeper
5 John        All rounder
6 Harry       Batsman

In [30]:
#rbind
students = rbind(football,cricket)

ERROR: Error in match.names(clabs, names(xi)): names do not match previous names

In [32]:
colnames(football) <- c("name","type")
colnames(cricket) <- c("name","type")

In [33]:
#rbind
students = rbind(football,cricket)

In [41]:
students

   name   type
1  Rahul  Center
2  Punit  Forward
3  Jhon   Goal Keeper
4  Natsha Forward
5  Harry  Defence
6  Sachin BatsMan
7  Rahul  Fast Bowler
8  Rajat  Spin Bowler
9  Ravi   Wicket Keeper
10 John   All rounder
11 Harry  Batsman

In [46]:
#sorting Data
vec1 = sample(45:60,30,replace=T)

In [47]:
vec1

 [1] 50 59 58 45 53 46 48 47 51 58 54 55 53 56 48 51 48 47 52 57 46 48 49 47 57
[26] 49 45 59 47 57

In [50]:
vec1_sort = sort(vec1)
vec1_sort

 [1] 45 45 46 46 47 47 47 47 48 48 48 48 49 49 50 51 51 52 53 53 54 55 56 57 57
[26] 57 58 58 59 59

In [53]:
d = sample(10)
d

 [1]  4  1  8  2  7  9 10  5  6  3

In [54]:
order(d)

 [1]  2  4 10  1  8  9  5  3  6  7

In [55]:
d[order(d)]

 [1]  1  2  3  4  5  6  7  8  9 10

In [59]:
#reverse order sorting
sort(d,decreasing =T)

 [1] 10  9  8  7  6  5  4  3  2  1

In [58]:
d[order(-d)]

 [1] 10  9  8  7  6  5  4  3  2  1

In [66]:
#Data Frame sorting 
d = data.frame(id=c(1,2,3,4,5,6),height=c(5.05,5.11,5.04,5.07,5.03,5.10),
              weight=c(60,65,55,59,55,70),
              color=c('fair','dull','fair','fair','dull','dull')
              )
d

  id height weight color
1 1  5.05   60     fair
2 2  5.11   65     dull
3 3  5.04   55     fair
4 4  5.07   59     fair
5 5  5.03   55     dull
6 6  5.10   70     dull

In [67]:
#sort by height 
d[order(d$height),]

  id height weight color
5 5  5.03   55     dull
3 3  5.04   55     fair
1 1  5.05   60     fair
4 4  5.07   59     fair
6 6  5.10   70     dull
2 2  5.11   65     dull

In [71]:
#sort by height than sort by weight 
d[order(d$height,d$weight),]

  id height weight color
5 5  5.03   55     dull
3 3  5.04   55     fair
1 1  5.05   60     fair
4 4  5.07   59     fair
6 6  5.10   70     dull
2 2  5.11   65     dull

In [75]:
#first sort by color than sort by height
d[order(d$color,d$height),]

  id height weight color
5 5  5.03   55     dull
6 6  5.10   70     dull
2 2  5.11   65     dull
3 3  5.04   55     fair
1 1  5.05   60     fair
4 4  5.07   59     fair

In [78]:
#reverse order sorting
#first sort by color than sort by height
d[order(d$color,-d$height),]

  id height weight color
2 2  5.11   65     dull
6 6  5.10   70     dull
5 5  5.03   55     dull
4 4  5.07   59     fair
1 1  5.05   60     fair
3 3  5.04   55     fair

In [79]:
#you can Transpose Matrix by t() function 
d1 = t(d)
d1

       [,1] [,2] [,3] [,4] [,5] [,6]
id     1    2    3    4    5    6
height 5.05 5.11 5.04 5.07 5.03 5.10
weight 60   65   55   59   55   70
color  fair dull fair fair dull dull